Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: pg_lo_write() writes at most to a large object from a variable data and returns the number of bytes actually written, or FALSE in the case of an error. large_object is a large object resource from pg_lo_open().
pt_br: pg_lo_write() escreve em um objeto grande (large object) a partir de uma variável data e retorna o número de bytes escritos, ou FALSE em caso de erro. large_object é um recurso (resource) de objeto grande criado a partir de pg_lo_open().

source: This function used to be called pg_lo_write().
pt_br: Esta função era chamada pg_lo_write().

source: See also pg_lo_create() and pg_lo_open().
pt_br: Veja também pg_lo_create() e pg_lo_open().

source: pg_num_fields() returns the number of fields (columns) in a PostgreSQL result.
pt_br: pg_num_fields() retorna o número de campos (colunas) do recurso (resource) de resultado result.

source: The argument is a result resource returned by pg_query().
pt_br: O argumento é um recurso (resource) de resultado criado a partir de pg_query().

source: This function used to be called pg_numfields().
pt_br: Esta função era chamada pg_numfields().

source: See also pg_num_rows() and pg_affected_rows().
pt_br: Veja também pg_num_rows() e pg_affected_rows().

source: pg_num_rows() will return the number of rows in a PostgreSQL result resource. result is a query result resource returned by pg_query().
pt_br: pg_num_rows() irá retornar o número de linhas do recurso de resultado result. result é um recurso (resource) de resultado de consulta (query) feito por pg_query().

source: Use pg_affected_rows() to get number of rows affected by INSERT, UPDATE and DELETE query.
pt_br: Use pg_affected_rows() para obter o número de linhas afetadas por consultas do tipo INSERT, UPDATE e DELETE.

source: This function used to be called pg_numrows().
pt_br: Esta função era chamada pg_numrows().

source: See also pg_num_fields() and pg_affected_rows().
pt_br: Veja também pg_num_fields() e pg_affected_rows().

source: pg_options() will return a string containing the options specified on the given PostgreSQL connection resource.
pt_br: pg_options() retornará uma string contendo as opções especificadas no recurso (resource) de conexão PostgreSQL connection.

source: pg_pconnect() opens a connection to a PostgreSQL database.
pt_br: Descrição

source: It returns a connection resource that is needed by other PostgreSQL functions.
pt_br: pg_pconnect() abre uma conexão a um banco de dados PostgreSQL.

source: For a description of the connection_string parameter, see pg_connect().
pt_br: Retorna um recurso (resource) de conexão que é necessário para outras funções PostgreSQL.

source: To enable persistent connection, the pgsql.allow_persistent php.ini To enable persistent connection, the pgsql.allow_persistent php.ini directive must be set to "On" (which is the default).
pt_br: Para habilitar uma conexão persistente, a diretiva pgsql.allow_persistent do php.ini deve ser definida como "On" (que é o padrão).

source: The maximum number of persistent connection can be defined with the pgsql.max_persistent php.ini The maximum number of persistent connection can be defined with the pgsql.max_persistent php.ini directive (defaults to -1 for no limit).
pt_br: O número máximo de conexões persistentes pode ser definida com a diretiva pgsql.max_persistent do php.ini O número máximo de conexões persistentes pode ser definida com a diretiva pgsql.max_persistent do php.ini (o padrão é -1 para sem limite).

source: The total number of connections can be set with the pgsql.max_links php.ini directive.
pt_br: O número total de conexões pode ser definido com a diretiva pgsql.max_links do php.ini.

source: pg_close() will not close persistent links generated by pg_pconnect().
pt_br: pg_close() não fechará links persistentes gerados por pg_pconnect().

source: See also pg_connect(), and the section Persistent Database Connections for more information.
pt_br: Veja também pg_connect().

source: pg_ping() ping database connection, try to reconnect if it is broken.
pt_br: pg_ping() faz um ping na conexão com o banco de dados, tenta reconectar se a conexão foi quebrada.

source: It returns TRUE if connection is alive, otherwise FALSE.
pt_br: Retorna TRUE se a conexão está ativa, do contrário, retorna FALSE.

source: See also pg_connection_status() and pg_connection_reset().
pt_br: Veja também pg_connection_status() e pg_connection_reset().

source: ?php $conn = pg_pconnect ("dbname=publisher"); if (!$conn) {echo "An error occured.\n"; exit;} if (!pg_ping($conn)) die("Connection is broken\n");?
pt_br: ?php $conn = pg_pconnect ("dbname=publicacao"); if (!$conn) {echo "Ocorreu um erro.\n"; exit;} if (!pg_ping($conn)) die("Conexão quebrada\n");?

source: pg_port() returns the port number that the given PostgreSQL connection resource is connected to.
pt_br: pg_port() retorna o número da porta a qual o recurso de conexão PostgreSQL connection está conectado.

source: pg_put_line() sends a NULL-terminated string to the PostgreSQL backend server.
pt_br: pg_put_line() envia uma string terminada em NULL para o servidor backend PostgreSQL.

source: This is useful for example for very high-speed inserting of data into a table, initiated by starting a PostgreSQL copy-operation.
pt_br: Isso é útil, por exemplo, para a inserção de dados em uma tabela em alta velocidade, iniciada através de uma operação de cópia PostgreSQL.

source: That final NULL-character is added automatically.
pt_br: O caractere NULL final é adicionado automaticamente.

source: The application must explicitly send the two characters "\." on the last line to indicate to the backend that it has finished sending its data.
pt_br: A aplicação deve enviar os dois caracteres "\." explicitamente na última linha para indicar ao backend que ela terminou de enviar seus dados.

source: See also pg_end_copy().
pt_br: Veja também pg_end_copy().

source: High-speed insertion of data into a table
pt_br: Inserção de dados na tabela em alta velocidade

source: ?php $conn = pg_pconnect ("dbname=foo"); pg_query($conn, "create table bar (a int4, b char(16), d float8)"); pg_query($conn, "copy bar from stdin"); pg_put_line($conn, "3\thello world\t4.5\n"); pg_put_line($conn, "4\tgoodbye world\t7.11\n"); pg_put_line($conn, "\\.\n"); pg_end_copy($conn);?
pt_br: ?php $conn = pg_pconnect ("nomebd=meubanco"); pg_query($conn, "create table bar (a int4, b char(16), d float8)"); pg_query($conn, "copy bar from stdin"); pg_put_line($conn, "3\tola mundo\t4.5\n"); pg_put_line($conn, "4\ttchau mundo\t7.11\n"); pg_put_line($conn, "\\.\n"); pg_end_copy($conn);?

source: pg_query() returns a query result resource if query could be executed.
pt_br: Descrição

source: It returns FALSE on failure or if connection is not a valid connection.
pt_br: pg_query() retorna um recurso (resource) de resultado da consulta (query) se a consulta pôde ser executada.

source: The connection must be a valid connection that was returned by pg_connect() or pg_pconnect().
pt_br: Detalhes sobre os erros podem ser recuperados usando a função pg_last_error() se a conexão é válida. pg_last_error() envia uma declaração SQL para o banco de dados PostgreSQL especificado pelo recurso de conexão connection. connection deve ser uma conexão válida que foi criado por pg_connect().

source: The return value of this function is an query result resource to be used to access the results from other PostgreSQL functions such as pg_fetch_array().
pt_br: O valor de retorno dessa função é um recurso (resource) de resultado de consulta (query) para ser usado para acessar os resultados de outras funções PostgreSQL como pg_fetch_array().

source: If connection is not set, default connection is used.
pt_br: Se connection não for definido, a conexão padrão será usada.

source: Default connection is the last connection made by pg_connect() or pg_pconnect().
pt_br: A conexão padrão é a última conexão feita por pg_connect() ou pg_pconnect().

source: Although connection can be omitted, it is not recommended, since it could be a cause of hard to find bug in script.
pt_br: Apesar de connection poder ser omitido, isso não é recomendado já que pode ser uma causa de erros difíceis de encontrar no seu script.

source: This function used to be called pg_exec(). pg_exec() is still available for compatibility reasons but users are encouraged to use the newer name.
pt_br: Esta função era chamada pg_exec(). pg_exec() ainda está disponível por razões de compatibilidade, mas os usuários são encorajados a usar o novo nome.

source: See also pg_connect(), pg_pconnect(), pg_fetch_array(), pg_fetch_object(), pg_num_rows(), and pg_affected_rows().
pt_br: Veja também pg_connect(), pg_pconnect(), pg_fetch_array(), pg_fetch_object(), pg_num_rows(), e pg_affected_rows().

source: pg_result_error() returns error message associated with result resource.
pt_br: pg_result_error() retorna a mensagem de erro associada ao recurso (resource) de resultado result.

source: Therefore, user has better chance to get better error message than pg_last_error().
pt_br: Deste modo, o usuário tem melhores chances de ter uma mensagem de erro melhor que a retornada por pg_last_error().

source: See also pg_query(), pg_send_query(), pg_get_result(), pg_last_error() and pg_last_notice()
pt_br: Veja também pg_query(), pg_send_query(), pg_get_result(), pg_last_error() e pg_last_notice()

source: pg_result_seek() set internal row offset in reuslt resource.
pt_br: Descrição

source: It returns FALSE, if there is error.
pt_br: pg_result_seek() altera a posição do ponteiro interno de um recurso (resource) de resultado.

source: See also pg_fetch_row(), pg_fetch_assoc(), pg_fetch_array(), pg_fetch_object() and pg_fetch_result().
pt_br: Veja também pg_fetch_row(), pg_fetch_assoc(), pg_fetch_array(), pg_fetch_object() e pg_fetch_result().

source: pg_result_status() returns status of result resource.
pt_br: pg_result_status() retorna o status do recurso (resource) de resultado.

source: Possible retun values are PGSQL_EMPTY_QUERY, PGSQL_COMMAND_OK, PGSQL_TUPLES_OK, PGSQL_COPY_TO, PGSQL_COPY_FROM, PGSQL_BAD_RESPONSE, PGSQL_NONFATAL_ERROR and PGSQL_FATAL_ERROR.
pt_br: PGSQL_EMPTY_QUERY, PGSQL_COMMAND_OK, PGSQL_TUPLES_OK, PGSQL_COPY_TO, PGSQL_COPY_FROM, PGSQL_BAD_RESPONSE, PGSQL_NONFATAL_ERROR e PGSQL_FATAL_ERROR.

source: See also pg_connection_status().
pt_br: Veja também pg_connection_status().

source: pg_select() selects records specified by assoc_array which has field= value.
pt_br: pg_select() seleciona registros especificados por assoc_array, que contém pares do tipo campo= valor.

source: For successful query, it returns array contains all records and fields that match the condition specified by assoc_array.
pt_br: Para uma consulta (query) válida, retorna um array que contém todos os registros e campos que combinam com a condição especificada por assoc_array.

source: Example 1. pg_select
pt_br: Exemplo 1. pg_select

source: ?php $db = pg_connect ('dbname=foo'); / / This is safe, since $_POST is converted automatically $rec = pg_select($db, 'post_log', $_POST); if ($rec) {echo "Records selected\n"; var_dump($rec);} else {echo "User must have sent wrong inputs\n";}?
pt_br: ?php $db = pg_connect ('nomebd=meubanco'); / / Isto é seguro já que $_POST é convertida automaticamente $rec = pg_select($bd, 'post_log', $_POST); if ($rec) {echo "Registros selecionados\n"; var_dump($rec);} else {echo "O usuário deve ter inserido dados errados\n";}?

source: pg_send_query() send asynchronous query to the connection.
pt_br: pg_send_query() envia uma consulta (query) assíncrona para connection.

source: Unlike pg_query(), it can send multiple query to PostgreSQL and get the result one by one using pg_get_result().
pt_br: Diferente de pg_query(), ela pode enviar consultas múltiplas para o PostgreSQL e carregar os resultados, um por um, usando pg_get_result().

source: Script execution is not blocked while query is executing.
pt_br: A execução do script não é bloqueada enquanto as consultas estão sendo executadas.

source: Use pg_connection_busy() to check connection is busy (i.e. query is executing).
pt_br: Use pg_connection_busy() para checar se a conexão está ocupada. (por exemplo, se uma consulta está sendo executada).

source: Query may be canceled by calling pg_cancel_query().
pt_br: A consulta pode ser cancelada chamando pg_cancel_query().

source: Although user can send multiple query at once, user cannot send multiple query over busy connection.
pt_br: Apesar de ser possível enviar multiplas consultas de uma vez, você não pode enviar múltiplas consultas para uma conexão ocupada.

source: If query is sent while connection is busy, it waits until last query is finished and discards all result.
pt_br: Se a consulta é enviada enquando a conexão está ocupada ela espera até que a última cosulta seja finalizada e descarta todos os resultados.

source: See also pg_query(), pg_cancel_query(), pg_get_result() and pg_connection_busy()
pt_br: Veja também pg_query(), pg_cancel_query(), pg_get_result() e pg_connection_busy()

source: pg_set_client_encoding() sets the client encoding and returns 0 if success or -1 if error.
pt_br: pg_set_client_encoding() define a codificação do cliente e retorna 0 caso haja sucesso e -1 se houver erro.

source: encoding is the client encoding and can be either:
pt_br: encoding é a codificação do cliente e pode ter os valores:

source: Available encoding depends on your PostgreSQL and libpq version.
pt_br: As codificações disponíveis dependem da versão do PostgreSQL e libpq.

source: Refer to PostgreSQL manual for supported encodings for your PostgreSQL.
pt_br: Vide o manual PostgreSQL para saber das codificações disponíveis para o seu PostgreSQL.

source: This function requires PHP-4.0.3 or higher and PostgreSQL-7.0 or higher.
pt_br: Esta função exige o PHP 4.0.3 ou maior e PostgreSQL 7.0 ou maior.

source: Refer to PostgreSQL manual for details.
pt_br: Vide o manual PostgreSQL para detalhes.

source: The function used to be called pg_setclientencoding().
pt_br: Esta função era chamada pg_setclientencoding().

source: See also pg_client_encoding().
pt_br: Veja também pg_client_encoding().

source: pg_trace() enables tracing of the PostgreSQL frontend / backend communication to a debugging file specified as pathname.
pt_br: pg_trace() habilita o rastreamento da comunicação frontend / backend do PostgreSQL para um arquivo de depuração especificado pelo parâmetro pathname.

source: To fully understand the results, one needs to be familiar with the internals of PostgreSQL communication protocol.
pt_br: Para entender completamente estes resultados, você deve estar familiarizado com o protocolo de comunicação interno do PostgreSQL.

source: For those who are not, it can still be useful for tracing errors in queries sent to the server, you could do for example grep '^To backend' trace.log and see what query actually were sent to the PostgreSQL server.
pt_br: Para aqueles que não estão, isso ainda pode ser útil para rastrear erros em consultas (queries) enviadas ao servidor, você poderia fazer por exemplo grep '^Para backend 'rastro.log.

source: For more information, refer to PostgreSQL manual.
pt_br: Para maiores informações vide o manual PostgreSQL.

source: pathname and mode are the same as in fopen() (mode defaults to'w'), connection specifies the connection to trace and defaults to the last one opened.
pt_br: pathname e mode são os mesmos que na função fopen() (o mode padrão é 'w'), connection especifica a conexão a ser rastreada e seu padrão é a última conexão aberta.

source: It returns TRUE if pathname could be opened for logging, FALSE otherwise.
pt_br: Retorna TRUE se o pathname pode ser aberto para escrita, FALSE caso contrário.

source: See also fopen() and pg_untrace().
pt_br: Veja também fopen() e pg_untrace().

source: pg_tty() returns the tty name that server side debugging output is sent to on the given PostgreSQL connection resource.
pt_br: pg_tty() retorna o nome da tty que a saída do lado do servidor é enviada no recurso (resource) de conexão connection.

source: pg_unescape_bytea() unescapes string from bytea datatype.
pt_br: pg_unescape_bytea() faz uma versão binária da string do tipo bytea.

source: It returns unescaped string (binary).
pt_br: Retorna a string em binário( binary).

source: See also pg_escape_bytea() and pg_escape_string()
pt_br: Veja também pg_escape_bytea() e pg_escape_string()

source: Stop tracing started by pg_trace(). connection specifies the connection that was traced and defaults to the last one opened.
pt_br: Pára o rastreamento iniciado por pg_trace(). connection especifica a conexão que está sendo rastreada e seu padrão é a última conexão aberta.

source: Returns always TRUE.
pt_br: Sempre retorna TRUE.

source: See also pg_trace().
pt_br: Veja também pg_trace().

source: pg_update() updates records that matches condition with data.
pt_br: pg_update() atualiza registros que combinam com a condição especificada pelo argumento condition com os dados do parâmetro data.

source: If options is specified, pg_convert() is applied to data with specified options.
pt_br: Se options for especificado, pg_convert() será aplicada a data com as opções especificadas.

source: Example 1. pg_update
pt_br: Exemplo 1. pg_update

source: ?php $db = pg_connect ('dbname=foo'); $data = array('field1'= 'AA', 'field2'= 'BB'); / / This is safe, since $_POST is converted automatically $res = pg_update($db, 'post_log', $_POST, $data); if ($res) {echo "Data is updated: $res\n";} else {echo "User must have sent wrong inputs\n";}?
pt_br: ?php $bd = pg_connect ('dbname=meubanco'); $dados = array('campo1'= 'AA', 'campo2'= 'BB'); / / Isto é seguro já que $_POST é convertido automaticamente $res = pg_update($bd, 'post_log', $_POST, $dados); if ($res) {echo "Dados atualizados: $res\n";} else {echo "Usuário deve ter enviado entradas inválidas\n";}?

source: Table 1. phpinfo() options
pt_br: Tabela 1. phpinfo() options

source: Example 1. phpinfo() examples
pt_br: Exemplo 1. phpinfo() examples

source: This functionality was added in PHP 4.0.0.
pt_br: Nota:

source: Example 1. php_sapi_name() Example
pt_br: Exemplo 1. php_sapi_name() Example

source: Example 1. php_uname() Example
pt_br: Exemplo 1. php_uname() Example

source: Example 1. phpversion() Example
pt_br: Exemplo 1. phpversion() Example

source: Returns an approximation of pi.
pt_br: Descrição

source: The returned float has a precision based on the precision directive in php.ini, which defaults to 14.
pt_br: O valor retornado float tem a precisão baseada na diretiva precision do php.ini, que tem por padrão 14.

source: Also, you can use the M_PI constant which yields identical results to pi().
pt_br: Também é possivel usar a constante M_PI que terá resultados idênticos a pi().

source: Opens a pipe to a process executed by forking the command given by command.
pt_br: Descrição

source: This pointer may be used with fgets(), fgetss(), and fputs().
pt_br: Abre uma pipe para um processo executado ao se dar um fork para o comando dado por command.

source: If you' re looking for bi-directional support (two-way), use proc_open().
pt_br: Caso um erro ocorra retorna FALSE.

source: Example 1. popen() examole
pt_br: Se você está procurando por suporte bidirecional (via dupla), utilize proc_open().

source: ?php $handle = popen ("/ bin / ls", "r");?
pt_br: ?php $fp = popen ("/ bin / ls", "r");?

source: If the command to be executed could not be found, a valid resource is returned.
pt_br: Se o commando a ser executado não for encontradom um recurso válido será retornado.

source: This may seem odd, but makes sense; it allows you to access any error message returned by the shell:
pt_br: Isso pode parecer esquisito, mas tem sentido: permite que você acesse a mensagem de erro retornado pelo sistema operacional.

source: ?php error_reporting( E_ALL); / * Add redirection so we can get stderr. * / $handle = popen(' / path / to / spooge 2 1', 'r'); echo "'$handle'; ". gettype($handle). "\n"; $read = fread($handle, 2096); echo $read; pclose($handle);?
pt_br: ?php error_reporting( E_ALL); / * Add redirection so we can get stderr. * / $fp = popen(' / path / to / spooge 2 1', 'r'); echo "'$fp'; ". gettype($fp). "\n"; $read = fread($fp, 2096); echo $read; pclose($fp);?

source: See also pclose(), fopen(), and proc_open().
pt_br: Veja também pclose(), fopen() e proc_open().

source: This is an alias for current().
pt_br: Essa função é um alias para current().

source: See also end(), next(), prev(), and reset().
pt_br: Veja também end(), next(), prev() e reset().

source: Needs to be written.
pt_br: Esta função não está documentada, somente a lista de argumentos está disponível.

source: Needs to be written ASAP.
pt_br: Esta função não está documentada, somente a lista de argumentos está disponível.

source: (PHP 3 = 3.0.10, PHP 4)
pt_br: posix_getegid

source: Return the numeric effective group ID of the current process.
pt_br: Description

source: Return the numeric effective user ID of the current process.
pt_br: Description

source: Return the numeric real group ID of the current process.
pt_br: Description

source: Returns the process group identifier of the process pid.
pt_br: Description

source: Return the process group identifier of the current process.
pt_br: Description

source: Return the sid of the process pid.
pt_br: Description

source: Return the numeric real user ID of the current process.
pt_br: Description

source: Send the signal sig to the process with the process identifier pid.
pt_br: Description

source: When safe mode is enabled, PHP checks whether the directory in which you are about to operate has the same UID (owner) as the script that is being executed.
pt_br: Quando o safe-mode está ativo, o PHP verifica se o diretório que será afetado por essa operação tem o mesmo UID (proprietário) do script que está sendo executado.

source: Set the effective group ID of the current process.
pt_br: Description

source: Set the real user ID of the current process.
pt_br: Description

source: Set the real group ID of the current process.
pt_br: Description

source: Let the process pid join the process group pgid.
pt_br: Description

source: Make the current process a session leader.
pt_br: Description

source: Returns base raised to the power of exp.
pt_br: Retorna a base elevada ao expoente exp.

source: If possible, this function will return an integer.
pt_br: Se possível, esta função retornará um integer.

source: If the power cannot be computed, a warning will be issued, and pow() will return FALSE.
pt_br: Se a potência não puder ser calculada, um alerta será lançado, e pow() retornará FALSE.

source: Some examples of pow()
pt_br: Alguns exemplos de pow()

source: ?php var_dump( pow(2,8)); / / int(256) echo pow(-1,20); / / 1 echo pow(0, 0); / / 1 echo pow(-1, 5.5); / / error?
pt_br: ?php var_dump( pow(2,8)); / / int(256) echo pow(-1,20); / / 1 echo pow(0, 0); / / 1 echo pow(-1, 5.5); / / erro?

source: In PHP 4.0.6 and earlier pow() always returned a float, and did not issue warnings.
pt_br: No PHP 4.0.6 e posteriores, pow() sempre retornará um float, e não gerará avisos de erros.

source: See also exp() and sqrt().
pt_br: Veja também exp() e sqrt().

source: Example 1. preg_grep() example
pt_br: Exemplo 1. preg_grep() example

source: Searches subject for a match to the regular expression given in pattern.
pt_br: Description

source: Example 2. find the word "web"
pt_br: Exemplo 2. find the word "web"

source: Example 5.
pt_br: Exemplo 5.

source: Parameter flags was added in PHP 4 Beta 3.
pt_br: Nota:

source: Example 1. preg_split() Example 1. preg_split() example:
pt_br: Exemplo 1. preg_split() Exemplo 1. preg_split() example:
